benchmarks/results/20260908T1645Z_fp8kv-rx5/rx5-gnq-v2-quick/logs/decode_in256_out256_c8_r1.shape-warmup.log
INFO 09-08 17:10:28 [importing.py:45] Triton is installed but 0 active driver(s) found (expected 1). Disabling Triton to prevent runtime errors.
INFO 09-08 17:10:28 [importing.py:69] Triton not installed or not compatible; certain GPU-related functions will not be available.
WARNING 09-08 17:10:28 [interface.py:247] Failed to import from vllm._C: ImportError('libcuda.so.1: cannot open shared object file: No such file or directory')
Namespace(trust_remote_code=False, seed=20774927, num_prompts=8, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai', base_url='http://127.0.0.1:11435', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=8, model='Qwen3.8-27B-Quark-AWQ-MXFP4', input_len=256, output_len=256, tokenizer='/nvme/lexar-2/ai/models/Qwen3.8-27B-Quark-AWQ-MXFP4-amd', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=True, num_warmups=0, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,95,99', goodput=None, request_id_prefix='bench-c9b086ec-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 09-08 17:10:29 [utils.py:90] Sampling input_len from [256, 256] and output_len from [256, 256]
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 8
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     8         
Failed requests:                         0         
Maximum request concurrency:             8         
Benchmark duration (s):                  4.89      
Total input tokens:                      2048      
Total generated tokens:                  2048      
Request throughput (req/s):              1.64      
Output token throughput (tok/s):         419.19    
Peak output token throughput (tok/s):    168.00    
Peak concurrent requests:                8.00      
Total token throughput (tok/s):          838.37    
---------------Time to First Token----------------
Mean TTFT (ms):                          458.94    
Median TTFT (ms):                        513.56    
P50 TTFT (ms):                           513.56    
P90 TTFT (ms):                           513.87    
P95 TTFT (ms):                           513.96    
P99 TTFT (ms):                           514.03    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          10.45     
Median TPOT (ms):                        10.44     
P50 TPOT (ms):                           10.44     
P90 TPOT (ms):                           14.67     
P95 TPOT (ms):                           15.90     
P99 TPOT (ms):                           16.89     
---------------Inter-token Latency----------------
Mean ITL (ms):                           41.09     
Median ITL (ms):                         40.11     
P50 ITL (ms):                            40.11     
P90 ITL (ms):                            47.80     
P95 ITL (ms):                            48.28     
P99 ITL (ms):                            54.42     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          3124.61   
Median E2EL (ms):                        3030.95   
P50 E2EL (ms):                           3030.95   
P90 E2EL (ms):                           4253.42   
P95 E2EL (ms):                           4569.13   
P99 E2EL (ms):                           4821.70   
---------------Speculative Decoding---------------
Acceptance rate (%):                     53.99     
Acceptance length:                       3.99      
Drafts:                                  519       
Draft tokens:                            2873      
Accepted tokens:                         1551      
Per-position acceptance (%):
  Position 0:                            82.85     
  Position 1:                            54.91     
  Position 2:                            43.74     
  Position 3:                            38.54     
  Position 4:                            33.53     
  Position 5:                            24.08     
  Position 6:                            21.19     
==================================================