benchmarks/results/20260908T1645Z_fp8kv-rx5/rx5-gnq-v2-quick/logs/prefill_in2048_out64_c8_r1.log
INFO 09-08 17:11:36 [importing.py:45] Triton is installed but 0 active driver(s) found (expected 1). Disabling Triton to prevent runtime errors.
INFO 09-08 17:11:36 [importing.py:69] Triton not installed or not compatible; certain GPU-related functions will not be available.
WARNING 09-08 17:11:36 [interface.py:247] Failed to import from vllm._C: ImportError('libcuda.so.1: cannot open shared object file: No such file or directory')
Namespace(trust_remote_code=False, seed=20327215, num_prompts=16, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai', base_url='http://127.0.0.1:11435', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=8, model='Qwen3.8-27B-Quark-AWQ-MXFP4', input_len=2048, output_len=64, tokenizer='/nvme/lexar-2/ai/models/Qwen3.8-27B-Quark-AWQ-MXFP4-amd', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=True, num_warmups=0, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=['config=rx5-gnq-v2-quick', 'workload=prefill', 'input_tokens=2048', 'output_tokens=64', 'repetition=1', 'tp=2', 'spec=on', 'cpu_offload_gb=0', 'seed=20327215', 'temperature=0'], result_dir=None, result_filename='benchmarks/results/20260908T1645Z_fp8kv-rx5/rx5-gnq-v2-quick/raw/prefill_in2048_out64_c8_r1.json', ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,95,99', goodput=None, request_id_prefix='bench-e0c03662-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 09-08 17:11:37 [utils.py:90] Sampling input_len from [2048, 2048] and output_len from [64, 64]
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 8
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     16        
Failed requests:                         0         
Maximum request concurrency:             8         
Benchmark duration (s):                  9.68      
Total input tokens:                      32768     
Total generated tokens:                  1024      
Request throughput (req/s):              1.65      
Output token throughput (tok/s):         105.82    
Peak output token throughput (tok/s):    79.00     
Peak concurrent requests:                11.00     
Total token throughput (tok/s):          3492.14   
---------------Time to First Token----------------
Mean TTFT (ms):                          1683.63   
Median TTFT (ms):                        1356.06   
P50 TTFT (ms):                           1356.06   
P90 TTFT (ms):                           3361.56   
P95 TTFT (ms):                           3619.62   
P99 TTFT (ms):                           3619.65   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          44.65     
Median TPOT (ms):                        40.80     
P50 TPOT (ms):                           40.80     
P90 TPOT (ms):                           83.07     
P95 TPOT (ms):                           86.44     
P99 TPOT (ms):                           90.27     
---------------Inter-token Latency----------------
Mean ITL (ms):                           130.46    
Median ITL (ms):                         43.08     
P50 ITL (ms):                            43.08     
P90 ITL (ms):                            493.96    
P95 ITL (ms):                            515.47    
P99 ITL (ms):                            895.48    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          4496.67   
Median E2EL (ms):                        4578.19   
P50 E2EL (ms):                           4578.19   
P90 E2EL (ms):                           6864.57   
P95 E2EL (ms):                           7850.08   
P99 E2EL (ms):                           8563.31   
---------------Speculative Decoding---------------
Acceptance rate (%):                     43.55     
Acceptance length:                       3.03      
Drafts:                                  345       
Draft tokens:                            1612      
Accepted tokens:                         702       
Per-position acceptance (%):
  Position 0:                            66.38     
  Position 1:                            37.39     
  Position 2:                            31.59     
  Position 3:                            22.03     
  Position 4:                            18.26     
  Position 5:                            15.36     
  Position 6:                            12.46     
==================================================